#!/usr/bin/env ruby
# frozen_string_literal: true

cask_args appdir: '/Applications' if OS.mac?

tap 'homebrew/cask-fonts' || true
tap 'neovim/neovim' || true

brew 'bat'
brew 'btop'
brew 'colima'
brew 'coreutils'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'dotnet'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'htop'
brew 'hyperfine'
brew 'imagemagick'
brew 'lazydocker'
brew 'lsd'
brew 'neovim'
brew 'nvm'
brew 'pipx'
brew 'pyenv'
brew 'ranger'
brew 'rbenv'
brew 'ripgrep'
brew 'starship'
brew 'stow'
brew 'tldr'
brew 'tree'
brew 'tmux'
brew 'zoxide'

cask 'bruno'
cask 'discord'
cask 'font-mononoki-nerd-font'
cask 'google-chrome'
cask 'kitty'
cask 'protonvpn'
cask 'qbittorrent'
cask 'slack'
cask 'spotify'
cask 'vlc'

cask 'alt-tab' if OS.mac?
cask 'hyperkey' if OS.mac?
cask 'raycast' if OS.mac?
cask 'sf-symbols' if OS.mac?
