#!/usr/bin/env ruby
# frozen_string_literal: true

cask_args appdir: '/Applications' if OS.mac?

tap 'neovim/neovim' || true

brew 'bat'
brew 'colima'
brew 'coreutils'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'htop'
brew 'hyperfine'
brew 'lazydocker'
brew 'lsd'
brew 'mise'
brew 'neovim'
brew 'ripgrep'
brew 'starship'
brew 'stow'
brew 'tlrc'
brew 'tree'
brew 'yazi'
brew 'zoxide'

cask 'alt-tab' if OS.mac?
cask 'bruno' if OS.mac?
cask 'discord' if OS.mac?
cask 'font-mononoki-nerd-font' if OS.mac?
cask 'ghostty' if OS.mac?
cask 'hyperkey' if OS.mac?
cask 'jordanbaird-ice' if OS.mac?
cask 'kitty' if OS.mac?
cask 'protonvpn' if OS.mac?
cask 'qbittorrent' if OS.mac?
cask 'raycast' if OS.mac?
cask 'sf-symbols' if OS.mac?
cask 'slack' if OS.mac?
cask 'spotify' if OS.mac?
cask 'vlc' if OS.mac?
cask 'zen-browser' if OS.mac?
