#!/bin/zsh

# WARNING: Order matters!

### Completions

# This plugin is meant to be run near the TOP of your .zsh_plugins.txt file.
# Most other compinit plugins should be near the END of .zsh_plugins.txt so that $fpath
# has been fully populated. One such plugin is zsh-utils and its completion subplugin.

mattmc3/zephyr path:plugins/completion

### Regular Plugins

jeffreytse/zsh-vi-mode kind:defer
wfxr/forgit kind:defer

### Local Plugins

$ZDOTDIR/.aliases
$ZDOTDIR/user/git.zsh
$ZDOTDIR/user/utils.zsh
$ZDOTDIR/user/zvm.zsh

### Framework plugins

ohmyzsh/ohmyzsh path:plugins/brew kind:defer
ohmyzsh/ohmyzsh path:plugins/command-not-found kind:defer
ohmyzsh/ohmyzsh path:plugins/extract kind:defer
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z kind:defer
ohmyzsh/ohmyzsh path:plugins/starship 

unixorn/fzf-zsh-plugin path=bin kind=path
so-fancy/diff-so-fancy kind=path

### Final Plugins

Aloxaf/fzf-tab kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search kind:defer
